Revit 2027 API
AttachmentType Enumeration
 Enum determining whether a link is an attachment or an overlay
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AttachmentType
Public Enumeration AttachmentType
public enum class AttachmentType
type AttachmentType
Members
Member name | Value | Description
Attachment | 3 |  The link is an attachment. If the host file is linked into another file, the link will also be brought along.
Overlay | 2 |  The link is an overlay, only meant to be seen in this file. If the host is linked into another file, the link will not be brought along.
See Also
Reference
Autodesk.Revit.DB Namespace